import React from 'react'

export const Analysis = () => {
  return (
    <div className='container'>
      <p>
        Трансформация экономики под воздействием научно-технического прогресса, изменения потребительского поведения,
        образа жизни, цифровизации и глобализации привела к изменению подходов к пониманию маркетинга, который также
        эволюционировал.
        <br/>
        В реалиях данной ситуации, абсолютно любая компания, которая перестроила свои взгляды на бизнес и
        переориентировалась на решение актуальных потребностей клиентов, а также которая имеет возможность предложить
        клиенту высокий уровень обслуживания, будет несомненно в более выигрышном положении по сравнению с конкурентом,
        и сможет создать долгие взаимовыгодные эффективные взаимоотношения с клиентами. Но когда отсутствует единая база
        данных с информацией обо всех клиентах компании, предприятию очень тяжело вести эффективную деятельность по
        взаимодействию с клиентами, за счет чего падает объем продаж, теряется результативность от маркетинговой
        деятельности и уменьшается уровень обслуживания клиентов. Руководству тяжело осуществлять постоянный контроль за
        ходом работы сотрудников компании с клиентами и проводить мониторинг действий менеджеров отдела продаж, а также
        немало важным считается тот факт, что руководству тяжело увидеть способы увеличения продаж.
        <br/>
        Для формирования эффективного процесса коммуникации с клиентами и благодаря этому повышению объемов продаж
        существуют различные технологии, одной из которых является Customer Relationship Management (далее CRM) - это
        управление взаимодействием с клиентами.
      </p>
      <p>
        При анализе источников было выявлены возможные области, в которых необходимо провести дополнительные
        исследования. В исследовании зарубежных ученых («The Necessity of Using CRM» авторов H. Tohidi и M. M.Jabbari)
        поднимается вопрос необходимости внедрения CRM-системы для повышения качества обслуживания и более глубоких
        отношений с клиентами. В статье рассматривается целевой подход, разделенный на три технологические ветви,
        который позволит существенно повысить качество отношений с клиентами.
        <br/>
        В рассмотренных источниках были приведены современные методы и технологии разработки CRM-системы. В работе
        российских ученых (А.А. Нарцов, М.Л. Шустрова и Староверова Н.А.) подробно рассматривается процесс разработки
        системы, уделяется особое внимание методам разработки, происходит выбор наиболее оптимального и современного
        решения. Приведенные факторы обуславливают актуальность темы научно-исследовательской работы.
      </p>
      <div>
        <span className='text-bold'>Результаты исследования:</span>
        <ul>
          <li>
            Главная задача CRM заключается в объединении в единую систему разного рода информации о клиентах для
            построения
            наиболее эффективных и оптимальных вариантов построения отношений с ними.
          </li>
          <li>
            Проведенный анализ зарубежных и отечественных научных исследований по теме исследования позволил выявить
            возможные области, в которых необходимо провести дополнительные исследования.
          </li>
        </ul>
      </div>
    </div>
  )
}