import React from 'react'

export const Evaluation = () => {
  return (
    <div className='container'>
      <p>
        Чтобы лучше понять современные тренды и лучшие практики в разработке CRM-систем, а также определить оптимальный
        выбор методов и технологий в зависимости от конкретных целей и особенностей бизнеса, необходимо: выявить
        критерии эффективной CRM-системы, провести сравнительный анализ существующих систем и определить наиболее
        производительную в соответствии со сформулированными критериями.
      </p>
      <p>
        Эффективная CRM-система должна соответствовать определенным критериям, чтобы успешно поддерживать управление
        отношениями с клиентами. Проанализировав требования, предъявляемые к данным системам, можно выделить
        следующие критерии успешной CRM-системы:
      </p>
      <ol>
        <li>Централизованное хранение данных</li>
        <li>Автоматизация бизнес-процессов</li>
        <li>Интеграция с другими системами</li>
        <li>Аналитика и отчетность</li>
        <li>Персонализация</li>
        <li>Мобильная доступность</li>
        <li>Безопасность данных</li>
        <li>Масштабируемость</li>
        <li>Обучение и поддержка пользователей</li>
      </ol>
      <br/>
      <p>
        Эти критерии помогают обеспечить, что CRM-система действительно служит целям компании по улучшению отношений с
        клиентами и оптимизации бизнес-процессов, а также отражают актуальные и будущие тенденции в области
        CRM-систем,
        которые могут быть ключевыми для их эффективности и соответствия потребностям быстро меняющегося
        бизнес-ландшафта.
      </p>
      <div>
        <span className='text-bold'>Результаты исследования:</span>
        <p>
          В рамках выполнения НИР на основе анализа теоретического материала были выбраны и описаны критерии эффективно
          функционирующей CRM-системы: централизованное хранение данных, автоматизация бизнес-процессов, интеграция с
          другими системами и другие. Также был проведен сравнительный анализ существующих CRM-систем и дальнейший выбор
          системы Microsoft Dynamics 365 для оценки по сформированным критериям.
          <br/>
          Согласно проведенному оцениванию, можно сделать вывод, что CRM-система Microsoft Dynamics 365 полностью
          удовлетворяет составленным критериям производительной системы: она автоматизирует бизнес-процессы,
          обеспечивает
          безопасность хранящихся данных, имеет мощные инструменты аналитики и отчетности и.т.д.
        </p>
      </div>
    </div>
  )
}