[
  {
    "title": "CRM-система",
    "description": "Универсальное программное обеспечение, направленное на автоматизацию управления взаимоотношениями с клиентами. Современные CRM-системы предполагают комплексную, сквозную автоматизацию всех подразделений, задействованных в работе с клиентом."
  },
  {
    "title": "Облачная CRM",
    "description": "CRM-система, базы данных которой расположены на серверах третьей стороны (хостинг-провайдера). Доступ к системе осуществляется посредством web-интерфейса в браузере либо мобильной версии."
  },
  {
    "title": "Внедрение",
    "description": "Сложный многоэтапный процесс подготовки CRM-системы к эксплуатации. Включает в себя множество этапов от сбора требований и тестирования CRM-систем до доработок выбранного решения. На разных этапах внедрение проводится компанией самостоятельно и с помощью вендора (разработчика CRM-системы)."
  },
  {
    "title": "API",
    "description": "API (программный интерфейс приложения, интерфейс) — описание способов, которыми одна программа или приложение взаимодействует с другой. API позволяет создавать интеграции, передавать данные, использовать функции одной программы из другой."
  },
  {
    "title": "База данных",
    "description": "Упорядоченный набор структурированной информации или данных, которые обычно хранятся в электронном виде в компьютерной системе. База данных обычно управляется системой управления базами данных (СУБД)."
  },
  {
    "title": "Фреймворк",
    "description": "Программное обеспечение, облегчающее разработку и объединение разных компонентов большого программного проекта."
  },
  {
    "title": "React",
    "description": "JavaScript-библиотека с открытым исходным кодом для разработки пользовательских интерфейсов. React разрабатывается и поддерживается Facebook, Instagram и сообществом отдельных разработчиков и корпораций."
  },
  {
    "title": "PostgreSQL",
    "description": "Cвободная объектно-реляционная система управления базами данных. Существует в реализациях для множества UNIX-подобных платформ, включая AIX, различные BSD-системы, HP-UX, IRIX, Linux, macOS, Solaris/OpenSolaris, Tru64, QNX, а также для Microsoft Windows."
  },
  {
    "title": "Облачная платформа",
    "description": "Набор инструментов, предназначенных для удаленного запуска и использования приложений без затрат на приобретение серверной техники."
  },
  {
    "title": "Amazon Web Services",
    "description": "Коммерческое публичное облако, поддерживаемое и развиваемое компанией Amazon с 2006 года. Предоставляет подписчикам услуги как по инфраструктурной модели, так и платформенного уровня."
  },
  {
    "title": "JavaScript",
    "description": "Мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией спецификации ECMAScript. "
  },
  {
    "title": "Интерфейс пользователя",
    "description": "Интерфейс, обеспечивающий передачу информации между пользователем-человеком и программно-аппаратными компонентами компьютерной системы. "
  },
  {
    "title": "Архитектура программного обеспечения",
    "description": "Совокупность важнейших решений об организации программной системы. Позволяет системе работать предсказуемее, упрощает управление разработкой и развитием системы"
  },
  {
    "title": "Прототипирование",
    "description": "Один из начальных этапов разработки, в ходе которого создается предварительный дизайн сайта , лендинга, приложения или другого проекта (его структура со схематичным изображением основных элементов)."
  },
  {
    "title": "Тестирование программного обеспечения",
    "description": "Процесс исследования, испытания программного продукта, имеющий своей целью проверку соответствия между реальным поведением программы и её ожидаемым поведением."
  }
]