import React from 'react'

export const Methodology = () => {
  return (
    <div className='container'>
      <p>
        В настоящее время CRM-системы являются важным инструментом для организаций,
        помогающим управлять отношениями с клиентами и повышать эффективность бизнес-процессов. С помощью CRM
        предприятие получает полную информацию о своих клиентах и о том чего они хотят, позволяет подробно изучить свою
        целевую аудиторию. Далее эти данные руководство компании использует для выбора стратегии развития предприятия.
        Разработка данной системы требует глубокого понимания потребностей и ожиданий клиентов, а также применения
        современных методов и технологий.
        <br/>
        Однако, в связи с быстрым развитием информационных технологий и изменениями в требованиях рынка, необходимо
        постоянно исследовать и анализировать существующие методы и технологии разработки CRM-системы, чтобы обеспечить
        их эффективность и конкурентоспособность.
        <br/>
        Чтобы лучше понять современные тренды и лучшие практики в разработке CRM-систем, а также определить оптимальный
        выбор методов и технологий в зависимости от конкретных потребностей и особенностей бизнеса необходимо провести
        анализ методов, инструментов и технологий разработки CRM-систем, а также их преимущества, недостатки и потенциал
        применения.
      </p>
      <p>
        При анализе источников были выявлены возможные методологии, инструменты и технологии для разработки CRM-систем.
        <br/>
        В исследовании зарубежных ученых («The Necessity of Using CRM» авторов H. Tohidi и M. M.Jabbari) поднимается
        вопрос необходимости внедрения CRM-системы для повышения качества обслуживания и более глубоких отношений с
        клиентами. В статье рассмотрены задачи, поставленные заказчиком, иерархия субъектов компании, архитектура
        информационной системы, инструментальные технологии разработки. Технология внедрения CRM-решений позволила
        поднять качество коммуникации и оперативность работы с клиентской аудиторией агентства.
        <br/>
        В работе российских ученых (Нарцов А.А., Шустрова М.Л. и Староверова Н.А.) подробно рассматривается процесс
        разработки системы, уделяется особое внимание методам разработки, происходит выбор наиболее оптимального и
        современного решения. Приведенные факторы обуславливают актуальность темы научно-исследовательской работы.

      </p>
      <div>
        <span className='text-bold'>Результаты исследования:</span>
        <p>
          В рамках выполнения НИР на основе анализа отечественной и зарубежной литературы были определены современные
          методы и технологии разработки CRM-системы. В этот список вошли различные языки программирования, фреймворки,
          облачные сервисы и базы данных. Также был проведен сравнительный анализ этих технологий с целью выявления
          оптимального решения для разработки собственной CRM-системы.
          <br/>
          На основании имеющейся информации был выбран, а затем описан полный набор технологий необходимых для
          разработки
          CRM-системы: язык программирования Javascript и его надстройка Typescript, фреймворк React, база данных
          PostgreSQL и облачная платформа Amazon Web Services.
          <br/>
          Далее были описаны основные этапы разработки собственной CRM-системы.
        </p>
      </div>
    </div>
  )
}